БухЭксп/Reports/CW_ПрогонозДвиженияДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>CW_ПрогонозДвиженияДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресНастроек</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

БухЭксп/Enums/CW_НаправлениеСортировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_НаправлениеСортировки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоВозрастанию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоУбыванию</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_Грузоперевозки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_Грузоперевозки</Name>
			<Comment>Грузоперевозки</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.CW_Заявки</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСделкиФ</Name>
					<Comment>Дата сделки (фактическая)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Comment>Клиент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперативныйМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Груз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_МаршрутыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Типоразмер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипоразмерыКонтейнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CW_Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержитДинамическиеПараметры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Незаполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтслеживаемоеОборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ОтслеживаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПривязкиОборудования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтключитьСлежение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийБюджета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перекодирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коносамент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Коносаменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыГрузоперевозки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВладельца</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтрагентыПоБюджету</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыПараметровГрузоперевозки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВедущего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторыВедомых</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Раскрывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторГруппы</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВладельца</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порядок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Reports/CW_ПрогонозДвиженияДенежныхСредств/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
	ПериодОтчета.ДатаНачала 	= НачалоМесяца(ТекущаяДата());
	ПериодОтчета.ДатаОкончания 	= КонецМесяца(ТекущаяДата());  
	ПоказательРубли 	= истина;  
	ПоказательВалюта 	= истина;   
	ПоказатьСкрытьНастройки = истина;
	
	Параметры.Свойство("ПараметрКоманды", ПараметрКоманды); 
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");

	Варианты = ОтчетОбъект.СхемаКомпоновкиДанных.ВариантыНастроек;  
	Для Каждого Вариант из Варианты Цикл
		Элементы.КлючВарианта.СписокВыбора.Добавить(Вариант.Имя, Вариант.Представление);
	КонецЦикла;

	АдресСхемы = ПолучитьАдресСхемы();   

	Элементы.ПериодОтчета.Видимость = ВариантФормирования = 0;

	НастройкиНаСервере(); 
	
	//Работа с буфером обмена
	// Проверка буфера обмена на наличие скопированных строк
	УстановитьДоступностьКомандыВставки(ЭтотОбъект, Не CW_РаботаСБуферомОбмена.ПустойБуферОбмена());
	//Работа с буфером обмена	

КонецПроцедуры      

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЭтоАдресВременногоХранилища(АдресНастроек) Тогда
		Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(ПолучитьИзВременногоХранилища(АдресНастроек));  
	КонецЕсли; 
	
	Если ПараметрКоманды <> Неопределено Тогда
		МассивЭлементов = Новый Массив(ПараметрКоманды);
		Если МассивЭлементов.Количество() = 0 тогда
			Возврат;
		Конецесли;

		ВариантФормирования = 1;
		Элементы.ПериодОтчета.Видимость = ВариантФормирования = 0; 
		
		ПервыйЭлемент = МассивЭлементов[0];
		Если ТипЗнч(ПервыйЭлемент) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда    
			МассивЗначений = МассивЭлементов;
		ИначеЕсли  ТипЗнч(ПервыйЭлемент) = Тип("СправочникСсылка.CW_Заказы") Тогда
			МассивЗначений = ПолучитьМассивГрузоперевозокЗаказа(МассивЭлементов);	
		КонецЕсли;
		
		РезультатВыбора = новый Структура;
		РезультатВыбора.Вставить("Поле", "Грузоперевозка"); 
		
		ЭлементОтбора = ДобавитьЭлементОбора(РезультатВыбора);
		
		Если МассивЗначений.Количество() = 1 Тогда
			ЭлементОтбора.ПравоеЗначение = МассивЗначений[0];   
		Иначе
			СписокЗначений = Новый СписокЗначений;
			СписокЗначений.ЗагрузитьЗначения(МассивЗначений); 
			
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			ЭлементОтбора.ПравоеЗначение = СписокЗначений;
		КонецЕсли;
		
		СформироватьНаСервере(); 
		
		ПоказатьСкрытьНастройки = Ложь;
		НастройкиНаСервере(); 
		
		ВариантМодифицирован = Ложь;
		
	КонецЕсли;    
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьМассивГрузоперевозокЗаказа(МассивЗаказов)
	
	Массив = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	CW_Грузоперевозки.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
	               |ГДЕ
	               |	CW_Грузоперевозки.Заказ В(&МассивЗаказов)";
	
	Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Массив.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

&НаКлиенте
Процедура ВариантФормированияПриИзменении(Элемент)  

	Элементы.ПериодОтчета.Видимость = ВариантФормирования = 0;
	
	Если ВариантФормирования = 1 Тогда    
		РезультатВыбора = новый Структура;
		РезультатВыбора.Вставить("Поле", "Грузоперевозка");
		ДобавитьЭлементОбора(РезультатВыбора);
	КонецЕсли;   
	
	ВариантМодифицирован = ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;

	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаДобавленияГруппировки",ЭтотОбъект);  
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СхемаКомпоновкиДанных", 	АдресСхемы);
	ПараметрыФормы.Вставить("Режим", 					"Группировка");
	ПараметрыФормы.Вставить("ИсключенныеПоля", 			ПолучитьЗапрещенныеПоля());
	ПараметрыФормы.Вставить("ТекущаяСтрока", 			Неопределено);  
	
	ОткрытьФорму("ОбщаяФорма.CW_ФормаВыбораДоступногоПоля", ПараметрыФормы,Элемент,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры      

&НаКлиенте
Процедура ОбработкаДобавленияГруппировки(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено или РезультатВыбора = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;   
	
	НоваяСтрока = Группировки.Добавить();   
	НоваяСтрока.ИмяПоля 		=  РезультатВыбора.Поле;
	НоваяСтрока.Представление 	=  РезультатВыбора.Заголовок;
	НоваяСтрока.Сортировка 		= ПредопределенноеЗначение("Перечисление.CW_НаправлениеСортировки.ПоВозрастанию");
	
КонецПроцедуры
 
&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	Отказ = Истина;

	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаДобавленияОтбора", ЭтотОбъект);  
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СхемаКомпоновкиДанных", 	АдресСхемы);
	ПараметрыФормы.Вставить("Режим", 					"Отбор");
	ПараметрыФормы.Вставить("ИсключенныеПоля", 			ПолучитьЗапрещенныеПоля());
	ПараметрыФормы.Вставить("ТекущаяСтрока", 			Неопределено);  
	
	ОткрытьФорму("ОбщаяФорма.CW_ФормаВыбораДоступногоПоля", ПараметрыФормы,Элемент,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДобавленияОтбора(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено или РезультатВыбора = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;   
	
	ДобавитьЭлементОбора(РезультатВыбора);
	
	ВариантМодифицирован = Ложь;
	ОтборИзменен = Истина;
	
КонецПроцедуры   

&НаКлиенте
Функция ДобавитьЭлементОбора(РезультатВыбора)
	
	ЭлементОтбора = ОтборПоГрузоперевозке();
	
	Если ЭлементОтбора = Неопределено Тогда
		ЭлементОтбора = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(РезультатВыбора.Поле);
	Конецесли;
	
	ЭлементОтбора.Использование = Истина; 
	
	Если Элементы.КомпоновщикНастроекНастройкиОтбор.ТекущаяСтрока <> Неопределено Тогда
		Элементы.КомпоновщикНастроекНастройкиОтбор.Развернуть(Элементы.КомпоновщикНастроекНастройкиОтбор.ТекущаяСтрока);  
	КонецЕсли;    
	
	Возврат ЭлементОтбора;

КонецФункции

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПриИзменении(Элемент)
	ОтборИзменен = Истина;
	ВариантМодифицирован = Ложь;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЗапрещенныеПоля(Режим = "") Экспорт
	
	СписокПолей = Новый Массив;
	
	СписокПолей.Добавить("UserFields");
	СписокПолей.Добавить("DataParameters");
	СписокПолей.Добавить("SystemFields");
	СписокПолей.Добавить("ПериодОтчета");
	СписокПолей.Добавить("ПрогнозДень");
	СписокПолей.Добавить("ПрогнозМесяц");
	СписокПолей.Добавить("ПрогнозКвартал");
	СписокПолей.Добавить("ПрогнозГод");    
	СписокПолей.Добавить("ВидСтатьи");   
	СписокПолей.Добавить("СуммаВал");    
	СписокПолей.Добавить("СуммаРуб");   
	
	Возврат Новый ФиксированныйМассив(СписокПолей);
	
КонецФункции

&НаСервере
Функция ПолучитьАдресСхемы()
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	Возврат ПоместитьВоВременноеХранилище(ОтчетОбъект.СхемаКомпоновкиДанных, УникальныйИдентификатор);  
	
КонецФункции

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)   
	
	Если ОтборИзменен Тогда
		НастройкиКомпановки = Отчет.КомпоновщикНастроек.ПолучитьНастройки();
		Настройки.Вставить("НастройкиКомпановки", НастройкиКомпановки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если Настройки.Получить("ПериодОтчета") = Неопределено тогда
		ПериодОтчета.ДатаНачала 	= НачалоМесяца(ТекущаяДата());
		ПериодОтчета.ДатаОкончания 	= КонецМесяца(ТекущаяДата());  
	КонецЕсли;  
	
	Если Настройки.Получить("ПоказательРубли") = Неопределено тогда
		ПоказательРубли 	= истина;  
	КонецЕсли;  
	
	Если Настройки.Получить("ПоказательВалюта") = Неопределено тогда
		ПоказательВалюта 	= истина;  
	КонецЕсли;
	
	КлючВарианта = Настройки.Получить("КлючВарианта"); 
	Если Не ЗначениеЗаполнено(КлючВарианта) Тогда
		КлючВарианта = Элементы.КлючВарианта.СписокВыбора.Получить(0).Значение;  
	Конецесли;
	
	НастройкиКомпановки = Настройки.Получить("НастройкиКомпановки");
	Если НастройкиКомпановки <> Неопределено тогда      
		АдресНастроек = ПоместитьВоВременноеХранилище(НастройкиКомпановки, УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастройкиНаСервере() 
	
	Элементы.ГруппаНастройки.Видимость = ПоказатьСкрытьНастройки;
	Элементы.ФормаНастройки.Пометка = ПоказатьСкрытьНастройки;
	
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)   
	
	ПоказатьСкрытьНастройки = Не ПоказатьСкрытьНастройки;
	НастройкиНаСервере(); 
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда) 
	
	Если ВариантФормирования = 1 Тогда
		Если Не УстановленОтборПоГрузоперевозкам() Тогда
			ПоказатьПредупреждение(,"Не установлен отбор по грузопереовзкам!");	
			Возврат;
		КонецЕсли;
	КонецЕсли;  
	
	Если Не ПоказательВалюта
		И Не ПоказательРубли Тогда
			ПоказатьПредупреждение(,"Не установлен ни один показатель отчета!");
			Возврат;
	КонецЕсли;
	
	
	СформироватьНаСервере(); 

	ПоказатьСкрытьНастройки = Ложь;
	НастройкиНаСервере(); 
	
КонецПроцедуры    

&наКлиенте
Функция УстановленОтборПоГрузоперевозкам() 
	
	ЭлементОтбора = ОтборПоГрузоперевозке();
	Если ЭлементОтбора = Неопределено  или Не ЭлементОтбора.использование Тогда
		Возврат Ложь;
	КонецЕсли;     
	
	Если ТипЗнч(ЭлементОтбора.ПравоеЗначение) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
		Возврат ЗначениеЗаполнено(ЭлементОтбора.ПравоеЗначение);
	КонецЕсли;
	Если ТипЗнч(ЭлементОтбора.ПравоеЗначение) = Тип("СписокЗначений") Тогда 
		Если ЭлементОтбора.ПравоеЗначение.Количество() = 0 Тогда
			Возврат Ложь;
		КонецЕсли; 
		ЭлементСписка = ЭлементОтбора.ПравоеЗначение[0];
		Возврат ЗначениеЗаполнено(ЭлементСписка.Значение);
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции   

&НаКлиенте
Функция ОтборПоГрузоперевозке()
	
	Для Каждого ЭлементОтбора из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Грузоперевозка") Тогда
			Возврат ЭлементОтбора;	
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;     
	
КонецФункции

&НаСервере
Процедура СформироватьНаСервере()             

	СоответствиеНастроекОтчета = Новый Соответствие;   
	
	Показатели = Новый Соответствие;
	Показатели.Вставить("СуммаРуб", ПоказательРубли);
	Показатели.Вставить("СуммаВал", ПоказательВалюта);     
	
	СоответствиеНастроекОтчета.Вставить("ПериодОтчета",			ПериодОтчета);
	СоответствиеНастроекОтчета.Вставить("ВариантФормирования", 	ВариантФормирования);
	СоответствиеНастроекОтчета.Вставить("КлючВарианта", 		КлючВарианта);
	СоответствиеНастроекОтчета.Вставить("Показатели", 			Показатели);
	СоответствиеНастроекОтчета.Вставить("Группировки", 			Группировки.Выгрузить());
	СоответствиеНастроекОтчета.Вставить("ИсключитьВнутрихолдинговыеРасчеты", ИсключитьВнутрихолдинговыеРасчеты); 
	
	СоответствиеНастроекОтчета.Вставить("НастройкиКомпановщика", Отчет.КомпоновщикНастроек.ПолучитьНастройки());
	
	Отчет.АдресНастроек = ПоместитьВоВременноеХранилище(СоответствиеНастроекОтчета, УникальныйИдентификатор);
	
	ЭтаФорма.СкомпоноватьРезультат();
	
КонецПроцедуры


//Работа с буфером обмена
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ДанныеСкопированыВБуферОбмена" Тогда
		УстановитьДоступностьКомандыВставки(ЭтотОбъект, Истина);
	КонецЕсли;

КонецПроцедуры  

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьКомандыВставки(Форма, Доступность)

	Доступность = Не Форма.ТолькоПросмотр И Доступность;
	Элементы = Форма.Элементы;
	Элементы.КомандаБуфераОбменаВставить.Доступность = Доступность;
	
КонецПроцедуры  

&НаКлиенте
Процедура БуфераОбменаВставить(Команда)
	КоличествоСтрок = БуфераОбменаВставитьНаСервере();
	Если КоличествоСтрок <> Неопределено Тогда
		CW_РаботаСБуферомОбменаКлиент.ОповеститьОВставкеСтрокИзБуфераОбмена(ЭтаФорма, КоличествоСтрок);	
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция БуфераОбменаВставитьНаСервере()
	
	Возврат CW_РаботаСБуферомОбмена.УстановитьОтборКомпановщикаПоБуферуОбмена(Отчет.КомпоновщикНастроек);

КонецФункции    
//Работа с буфером обмена
